app/controllers/api/feeds_controller.rb

SELECT "feeds".* FROM "feeds"
---
  def index
    render :json => Feed.all

SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    render :json => Feed.find(params[:id]), include: :latest_entries

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "5"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 5]]
SELECT "feeds".* FROM "feeds"
---
  def destroy
    @feed = Feed.find(params[:id])

    if @feed.destroy
      render :json => Feed.all